const utils = require("../helpers/utils");
const dayjs = require("dayjs");
const { default: axios } = require("axios");

utils.getGroupByChatId();

jest.mock("axios");

describe("Schedule", () => {
  let response = {};
  beforeAll(() => {
    response = {
      date: {
        date: "01.09.2022",
        lessons: [
          {
            title: "МДК.06.01 Внедрение информационных систем",
            num: "1",
            teachername: "Сурков Антон Викторович",
            nameGroup: null,
            cab: "5/541",
            resource: "",
          },
          {
            title: "МДК.05.02 Разработка кода информационных систем",
            num: "2",
            teachername: "Безбородова Ульяна Михайловна",
            nameGroup: null,
            cab: "5/537",
            resource: "",
          },
          {
            title:
              "МДК.06.02 Инженерно-техническая поддержка сопровождения информационных систем ",
            num: "3",
            teachername: "Прокаева Кристина Евгеньевна",
            nameGroup: null,
            cab: "1/113",
            resource: "",
          },
        ],
      },
    };

    axios.get.mockReturnValue(response);
  });

  test("get correct schedule", async () => {
    const result = await utils.getSchedule(187, dayjs("2022-09-01"));

    expect(result).toEqual(response.data);
    expect(axios.get).toBeCalledTimes(1);
  });
});

describe("Groups", () => {
  let response = {};
  beforeAll(() => {
    response = {
      data: [
        { id: 32, name: "КС-17-01" },
        { id: 43, name: "УМД-17-01" },
        {
          id: 79,
          name: "ОП-17-01",
        },
        {
          id: 80,
          name: "ОП-17-02",
        },
        {
          id: 93,
          name: "СЭЗ-17-02",
        },
        {
          id: 105,
          name: "ТОА-17-01",
        },
        {
          id: 115,
          name: "ТР-17-02",
        },
        {
          id: 120,
          name: "ТТО-17-01",
        },
        {
          id: 126,
          name: "СЭЗ-18-01",
        },
        {
          id: 127,
          name: "УМД-18-01",
        },
        {
          id: 128,
          name: "КС-18-01",
        },
        {
          id: 132,
          name: "СА-18-01",
        },
        {
          id: 133,
          name: "ИС-18-01",
        },
        {
          id: 134,
          name: "ТО-18-01",
        },
        {
          id: 135,
          name: "БАС-18-01",
        },
        {
          id: 136,
          name: "ПД-18-01",
        },
        {
          id: 137,
          name: "ИС-18-02",
        },
        {
          id: 140,
          name: "ПКС-18-01",
        },
        {
          id: 141,
          name: "ТТО-18-01",
        },
        {
          id: 142,
          name: "МЛ-18-01",
        },
        {
          id: 143,
          name: "ОП-18-01",
        },
        {
          id: 144,
          name: "ТЖД-18-01",
        },
        {
          id: 145,
          name: "ОДЛ-18-01",
        },
        {
          id: 147,
          name: "ИД-18-01",
        },
        {
          id: 148,
          name: "ДО-18-01",
        },
        {
          id: 149,
          name: "Д-18-01",
        },
        {
          id: 150,
          name: "ДПИ-18-01",
        },
        {
          id: 151,
          name: "ТВК-18-01",
        },
        {
          id: 152,
          name: "ТР-18-02",
        },
        {
          id: 153,
          name: "ДО-18-02",
        },
        {
          id: 154,
          name: "СЭЗ-18-02",
        },
        {
          id: 155,
          name: "ДО-18-03",
        },
        {
          id: 156,
          name: "ОТЗ-18-01",
        },
        {
          id: 157,
          name: "ГД-18-01",
        },
        {
          id: 161,
          name: "ДПИ-19-01",
        },
        {
          id: 162,
          name: "Д-19-01",
        },
        {
          id: 163,
          name: "ГД-19-01",
        },
        {
          id: 164,
          name: "ПНК-19-01",
        },
        {
          id: 165,
          name: "ДО-19-01",
        },
        {
          id: 166,
          name: "ИД-19-01",
        },
        {
          id: 168,
          name: "К-19-01",
        },
        {
          id: 169,
          name: "ОДЛ-19-01",
        },
        {
          id: 170,
          name: "ПД-19-01",
        },
        {
          id: 171,
          name: "ТЖД-19-01",
        },
        {
          id: 172,
          name: "ОП-19-01",
        },
        {
          id: 173,
          name: "ТТО-19-01",
        },
        {
          id: 174,
          name: "ИС-19-01",
        },
        {
          id: 175,
          name: "СА-19-01",
        },
        {
          id: 176,
          name: "КС-19-01",
        },
        {
          id: 177,
          name: "УМД-19-01",
        },
        {
          id: 178,
          name: "УК-19-01",
        },
        {
          id: 179,
          name: "ТО-19-01",
        },
        {
          id: 180,
          name: "ТВК-19-01",
        },
        {
          id: 181,
          name: "МЛ-19-01",
        },
        {
          id: 182,
          name: "ОТЗ-19-01",
        },
        {
          id: 183,
          name: "ИС-19-03",
        },
        {
          id: 184,
          name: "ГД-19-02",
        },
        {
          id: 185,
          name: "ГД-19-03",
        },
        {
          id: 186,
          name: "ИС-19-02",
        },
        {
          id: 187,
          name: "ИС-19-04",
        },
        {
          id: 188,
          name: "ИС-19-05",
        },
        {
          id: 189,
          name: "БАС-19-01",
        },
        {
          id: 190,
          name: "ДО-19-02",
        },
        {
          id: 191,
          name: "ОДЛ-19-02",
        },
        {
          id: 192,
          name: "СЭЗ-19-01",
        },
        {
          id: 193,
          name: "ДО-19-03",
        },
        {
          id: 194,
          name: "ДО-19-04",
        },
        {
          id: 195,
          name: "ПКС-18-02",
        },
        {
          id: 196,
          name: "ИС-19-06",
        },
        {
          id: 197,
          name: "СЭЗ-19-02",
        },
        {
          id: 198,
          name: "УМД-20-01",
        },
        {
          id: 199,
          name: "КС-20-01",
        },
        {
          id: 200,
          name: "ИС-20-01",
        },
        {
          id: 201,
          name: "ИС-20-02",
        },
        {
          id: 202,
          name: "ИС-20-03",
        },
        {
          id: 203,
          name: "ИС-20-04",
        },
        {
          id: 204,
          name: "ИС-20-05",
        },
        {
          id: 205,
          name: "ОБ-20-01",
        },
        {
          id: 206,
          name: "ТТО-20-01",
        },
        {
          id: 207,
          name: "ТВК-20-01",
        },
        {
          id: 208,
          name: "ОП-20-01",
        },
        {
          id: 209,
          name: "ТЖД-20-01",
        },
        {
          id: 210,
          name: "ТО-20-01",
        },
        {
          id: 212,
          name: "УК-20-01",
        },
        {
          id: 213,
          name: "ПД-20-01",
        },
        {
          id: 214,
          name: "ОДЛ-20-01",
        },
        {
          id: 215,
          name: "К-20-01",
        },
        {
          id: 216,
          name: "ИД-20-01",
        },
        {
          id: 217,
          name: "Г-20-01",
        },
        {
          id: 218,
          name: "ДО-20-01",
        },
        {
          id: 219,
          name: "ДО-20-03",
        },
        {
          id: 220,
          name: "ДО-20-04",
        },
        {
          id: 221,
          name: "ПНК-20-01",
        },
        {
          id: 222,
          name: "ПНК-20-02",
        },
        {
          id: 223,
          name: "Д-20-01",
        },
        {
          id: 224,
          name: "Д-20-02",
        },
        {
          id: 225,
          name: "ДПИ-20-01",
        },
        {
          id: 226,
          name: "СЭЗ-20-01",
        },
        {
          id: 227,
          name: "СЭЗ-20-02",
        },
        {
          id: 228,
          name: "СА-20-01",
        },
        {
          id: 229,
          name: "ГД-20-01",
        },
        {
          id: 230,
          name: "ГД-20-02",
        },
        {
          id: 231,
          name: "МЦ-20-01",
        },
        {
          id: 232,
          name: "МЛ-20-01",
        },
        {
          id: 233,
          name: "ФК-20-01",
        },
        {
          id: 235,
          name: "ИС-20-06",
        },
        {
          id: 236,
          name: "ГД-20-03",
        },
        {
          id: 238,
          name: "БАС-20-01",
        },
        {
          id: 239,
          name: "ГД-20-04",
        },
        {
          id: 240,
          name: "ГД-20-05",
        },
        {
          id: 241,
          name: "ДО-20-02",
        },
        {
          id: 242,
          name: "ИС-20-07",
        },
        {
          id: 243,
          name: "К-20-02",
        },
        {
          id: 245,
          name: "ИД-20-02",
        },
        {
          id: 246,
          name: "ОДЛ-20-03",
        },
        {
          id: 247,
          name: "ГД-20-06",
        },
        {
          id: 248,
          name: "КС-21-01",
        },
        {
          id: 249,
          name: "СЭЗ-21-01",
        },
        {
          id: 250,
          name: "СЭЗ-21-02",
        },
        {
          id: 251,
          name: "УМД-21-01",
        },
        {
          id: 253,
          name: "СА-21-01",
        },
        {
          id: 254,
          name: "ИС-21-01",
        },
        {
          id: 255,
          name: "ИС-21-02",
        },
        {
          id: 256,
          name: "ИС-21-03",
        },
        {
          id: 257,
          name: "ИС-21-04",
        },
        {
          id: 258,
          name: "ИС-21-05",
        },
        {
          id: 259,
          name: "ИС-21-06",
        },
        {
          id: 260,
          name: "ИС-21-07",
        },
        {
          id: 261,
          name: "ОБ-21-01",
        },
        {
          id: 262,
          name: "ТТО-21-01",
        },
        {
          id: 263,
          name: "ТВК-21-01",
        },
        {
          id: 264,
          name: "ОП-21-01",
        },
        {
          id: 265,
          name: "ТЖД-21-01",
        },
        {
          id: 266,
          name: "ТО-21-01",
        },
        {
          id: 267,
          name: "БАС-21-01",
        },
        {
          id: 268,
          name: "УК-21-01",
        },
        {
          id: 269,
          name: "ПД-21-01",
        },
        {
          id: 270,
          name: "ОДЛ-21-01",
        },
        {
          id: 271,
          name: "ОДЛ-21-02",
        },
        {
          id: 272,
          name: "К-21-01",
        },
        {
          id: 273,
          name: "К-21-02",
        },
        {
          id: 274,
          name: "РК-21-01",
        },
        {
          id: 275,
          name: "ИД-21-01",
        },
        {
          id: 276,
          name: "ИД-21-02",
        },
        {
          id: 277,
          name: "Г-21-01",
        },
        {
          id: 278,
          name: "ДО-21-01",
        },
        {
          id: 279,
          name: "ДО-21-02",
        },
        {
          id: 280,
          name: "ДО-21-03",
        },
        {
          id: 281,
          name: "ДО-21-04",
        },
        {
          id: 282,
          name: "ПНК-21-01",
        },
        {
          id: 283,
          name: "ПНК-21-02",
        },
        {
          id: 284,
          name: "ДОУ-21-01",
        },
        {
          id: 285,
          name: "ФК-21-01",
        },
        {
          id: 286,
          name: "ФК-21-02",
        },
        {
          id: 287,
          name: "Д-21-01",
        },
        {
          id: 288,
          name: "Д-21-02",
        },
        {
          id: 289,
          name: "ДПИ-21-01",
        },
        {
          id: 290,
          name: "МЛ-21-01",
        },
        {
          id: 291,
          name: "ГД-21-01",
        },
        {
          id: 292,
          name: "ГД-21-02",
        },
        {
          id: 293,
          name: "ГД-21-03",
        },
        {
          id: 294,
          name: "ГД-21-04",
        },
        {
          id: 295,
          name: "Г-21-02",
        },
        {
          id: 297,
          name: "ДО-21-05",
        },
        {
          id: 298,
          name: "ДОУ-21-02",
        },
        {
          id: 301,
          name: "СЭЗ-22-01",
        },
        {
          id: 302,
          name: "СЭЗ-22-02",
        },
        {
          id: 303,
          name: "УМД-22-01",
        },
        {
          id: 304,
          name: "КС-22-01",
        },
        {
          id: 305,
          name: "СА-22-01",
        },
        {
          id: 306,
          name: "СА-22-02",
        },
        {
          id: 307,
          name: "ИС-22-01",
        },
        {
          id: 308,
          name: "ИС-22-02",
        },
        {
          id: 309,
          name: "ИС-22-03",
        },
        {
          id: 310,
          name: "ИС-22-04",
        },
        {
          id: 311,
          name: "ИС-22-05",
        },
        {
          id: 312,
          name: "ИС-22-06",
        },
        {
          id: 313,
          name: "ИС-22-07",
        },
        {
          id: 314,
          name: "ОБ-22-01",
        },
        {
          id: 315,
          name: "ТТО-22-01",
        },
        {
          id: 316,
          name: "ТВК-22-01",
        },
        {
          id: 317,
          name: "ОП-22-01",
        },
        {
          id: 318,
          name: "ТЖД-22-01",
        },
        {
          id: 319,
          name: "ТО-22-01",
        },
        {
          id: 320,
          name: "УК-22-01",
        },
        {
          id: 321,
          name: "ПД-22-01",
        },
        {
          id: 322,
          name: "ОДЛ-22-01",
        },
        {
          id: 323,
          name: "ОДЛ-22-02",
        },
        {
          id: 324,
          name: "К-22-01",
        },
        {
          id: 325,
          name: "К-22-02",
        },
        {
          id: 326,
          name: "РК-22-01",
        },
        {
          id: 327,
          name: "ИД-22-01",
        },
        {
          id: 328,
          name: "Г-22-01",
        },
        {
          id: 329,
          name: "ДО-22-01",
        },
        {
          id: 330,
          name: "ДО-22-02",
        },
        {
          id: 331,
          name: "ДО-22-03",
        },
        {
          id: 332,
          name: "ПНК-22-01",
        },
        {
          id: 333,
          name: "ПНК-22-02",
        },
        {
          id: 334,
          name: "ДОУ-22-01",
        },
        {
          id: 335,
          name: "ФК-22-01",
        },
        {
          id: 336,
          name: "ФК-22-02",
        },
        {
          id: 337,
          name: "ФК-22-03",
        },
        {
          id: 338,
          name: "Д-22-01",
        },
        {
          id: 339,
          name: "Д-22-02",
        },
        {
          id: 340,
          name: "ДПИ-22-01",
        },
        {
          id: 341,
          name: "ДПИ-22-02",
        },
        {
          id: 342,
          name: "ГД-22-01",
        },
        {
          id: 343,
          name: "ГД-22-02",
        },
        {
          id: 344,
          name: "ГД-22-03",
        },
        {
          id: 345,
          name: "ГД-22-04",
        },
        {
          id: 346,
          name: "МЛ-22-01",
        },
        {
          id: 347,
          name: "НП-22-01",
        },
        {
          id: 348,
          name: "К-22-03",
        },
        {
          id: 349,
          name: "КС-22-02",
        },
        {
          id: 350,
          name: "ГД-22-05",
        },
      ],
    };

    axios.get.mockReturnValue(response);
  });

  test("get correct groups", async () => {
    const result = await utils.getGroups();

    expect(result).toEqual(
      response.data.filter((group) => group.name !== "--")
    );
  });
});
